R3X06/stm32/PeripheralDrivers/Inc/odom.h
#ifndef __ODOM_H
#define __ODOM_H

#include "stm32f4xx_hal.h"

/* ---------------------------------------------------------------------------
 * Odometry and heading hold for the WHEELTEC C30D-V2.
 *
 * PHASE 3 CHANGE: heading is now held by the STEERING SERVO, not by trimming
 * one rear wheel against the other.
 *
 * This chassis is Ackermann. The front wheels are locked at whatever angle
 * the servo holds, so a wheel-speed difference cannot change the heading -
 * it only yaws the body against the front tyres and scrubs them sideways.
 * The old trim approach worked, but only by dragging the tyres, and it
 * needed a permanent offset to hold a straight line.
 *
 * The per-wheel speed PID stays. Its job is now purely to make Motor A and
 * Motor B run at the SAME speed. Steering is the servo's job alone.
 *
 * Odom_Update() runs from the TIM6 interrupt, after Encoders_Update() and
 * before PID_Update().
 * ------------------------------------------------------------------------- */

/* Geometry. WHEEL_BASE_MM here is the TRACK width (distance between the two
 * rear wheel centres) and is used only to infer heading from the encoder
 * difference. On an Ackermann chassis that inference is weak - the rear
 * wheels barely differ on a gentle curve - so treat encoder heading as a
 * rough estimate until the IMU is available. */
/* Effective rolling diameter of wheel A, mm. MEASURED - do not "correct"
 * this back to a catalogue figure.
 *
 * The wheel is sold as 2.4 inch (60.96 mm). That is the RIM. The tread
 * calipers at 65-66 mm, and four road tests agreed on 65.87 to 66.06 with
 * the wheels averaged.
 *
 * 65.6 rather than 65.9 because the per-wheel counts below changed what the
 * average means. Before, wheel B under-reported by 0.8%, so the averaged
 * odometry read 0.9961 of wheel A and 65.9 was an averaged figure absorbing
 * the mismatch. With B rescaled the average equals wheel A, so the diameter
 * has to come down by the same 0.39% or the robot stops 4 mm short.
 *
 * If a run lands short after this change, put it back to 65.9. */
#define WHEEL_DIAMETER_MM   65.9f
#define WHEEL_BASE_MM       127.0f

/* From the ten-revolution calibration. */
/* Counts per wheel revolution, PER WHEEL. B is NOT 1560, and that is
 * deliberate.
 *
 * Measured over four driven runs, wheel B counted 99.0, 99.2, 99.5 and 99.2
 * percent of wheel A. Steady, not scattering - the signature of a fixed
 * scale error rather than mechanical slip. (Slip was a real problem earlier
 * and was cured by tightening the hub grub screw; it showed up as a 32%
 * spread WITHIN a single run.)
 *
 * Why it matters far more than 0.8% sounds: odometry infers heading from
 * (dA - dB) / track. A steady 0.8% shortfall on B is read as a continuous
 * LEFTWARD yaw - about 3.5 degrees accumulated over a metre - and the
 * heading loop obediently steers RIGHT to cancel a rotation that is not
 * happening. That was the visible rightward drift.
 *
 * The control experiment: one run went visibly straight and STILL read
 * 99.2%. A genuinely straight run must give 100%, so the mismatch causes
 * the curve rather than resulting from it.
 *
 * 1560 x 0.9922 = 1548. Residual scatter is +-0.25%, which leaves about
 * 1.1 degrees of phantom yaw instead of 3.5.
 */
#define ODOM_COUNTS_PER_REV_A  1560.0f
/* Back to 1560, deliberately.
 *
 * 1548 was a correction for wheel B under-reporting by 0.8%, which odometry
 * was reading as a phantom leftward yaw and the servo was counter-steering
 * against. With heading now coming from the gyro, the encoder difference no
 * longer steers anything, so that correction has nothing left to fix - and
 * it WOULD disturb the distance calibration, which was measured at 0.0%
 * error with both wheels at 1560 and the diameter at 65.9.
 *
 * Change one thing at a time. The proven distance setup stays. */
#define ODOM_COUNTS_PER_REV_B  1560.0f

/* Kept for anything still referencing the single-wheel name. */
#define ODOM_COUNTS_PER_REV ODOM_COUNTS_PER_REV_A

/* 63.5 * pi / 1560 -- about 0.128 mm of travel per count. */
#define MM_PER_COUNT_A ((WHEEL_DIAMETER_MM * 3.14159265f) / ODOM_COUNTS_PER_REV_A)
#define MM_PER_COUNT_B ((WHEEL_DIAMETER_MM * 3.14159265f) / ODOM_COUNTS_PER_REV_B)
#define MM_PER_COUNT   MM_PER_COUNT_A

/* ---------------------------------------------------------------------------
 * Which wheel measures how far the robot went.
 *
 *   ODOM_DIST_AVERAGE  mean of both. Correct when both encoders are trusted:
 *                      the mean is the axle centre, which is what a distance
 *                      command means. Use this once B is healthy.
 *
 *   ODOM_DIST_A_ONLY   wheel A alone. Use when B cannot be trusted. On a
 *                      straight line A and the axle centre travel the same
 *                      distance, so nothing is lost for A.3 - and one good
 *                      encoder beats the average of a good one and a bad one,
 *                      because averaging does not cancel B's error, it halves
 *                      it and then hides it.
 *
 *   ODOM_DIST_B_ONLY   for swapping the test around.
 *
 * IN A TURN this matters: A is the left wheel, so on a right-hand arc it runs
 * wide and A_ONLY over-reports the centre's travel by (R + track/2)/R. The
 * arc primitives are not usable on A_ONLY without that correction.
 * ------------------------------------------------------------------------- */
#define ODOM_DIST_AVERAGE   0
#define ODOM_DIST_A_ONLY    1
#define ODOM_DIST_B_ONLY    2

#define ODOM_DIST_SOURCE    ODOM_DIST_AVERAGE

/* ---------------------------------------------------------------------------
 * Where heading comes from.
 *
 *   ODOM_HEADING_ENCODER  from (dA - dB) / track. Works, but weak on an
 *                         Ackermann chassis: the two rear wheels barely
 *                         differ on a gentle curve, so it is a small angle
 *                         inferred from the difference of two large numbers.
 *                         Any per-wheel scale mismatch shows up as a
 *                         constant phantom yaw. A measured 0.8% mismatch
 *                         produced 3.5 degrees of phantom yaw per metre.
 *
 *   ODOM_HEADING_IMU      integrated gyro Z. Measures yaw directly, so wheel
 *                         scale, slip and tyre scrub cannot corrupt it.
 *                         Measured on this robot: 90 degrees by hand read
 *                         90.5, and drift after zeroing is a fraction of a
 *                         degree - against 3.5 degrees of encoder phantom
 *                         yaw over the same run.
 *
 * The IMU setting falls back to the encoder automatically if IMU_IsReady()
 * is false, so a failed sensor degrades to the old behaviour instead of
 * leaving the robot with no heading at all.
 * ------------------------------------------------------------------------- */
#define ODOM_HEADING_ENCODER  0
#define ODOM_HEADING_IMU      1

#define ODOM_HEADING_SOURCE   ODOM_HEADING_IMU

/* ---------------------------------------------------------------------------
 * Heading hold tuning
 * ------------------------------------------------------------------------- */

/* Microseconds of servo deflection per degree of heading error.
 *
 * You measured roughly 19 us per degree of wheel steer. A gain of 8 means a
 * 5 degree heading error commands about 2 degrees of corrective steer, which
 * is a gentle correction. Raise until it corrects briskly; back off if it
 * weaves. */
#define HEADING_KP_US       8.0f

/* Ceiling on the correction, in microseconds either side of centre. Keeps a
 * large error from slamming the steering to full lock mid-run. 150 us is
 * about 8 degrees of steer. */
#define HEADING_MAX_US      150.0f

/* Below this the correction is suppressed entirely. Without it the servo
 * hunts around centre and buzzes. */
#define HEADING_DEADBAND_DEG  0.3f

/* Backlash compensation, microseconds.
 *
 * You measured roughly 50 us of slack between commanding a direction change
 * and the wheels responding. A plain proportional term produces corrections
 * smaller than that whenever the error is under ~2.5 degrees, so nothing
 * happens, the error grows, and then it over-corrects - the robot weaves.
 *
 * Once the correction is non-zero we add half the measured slack in the same
 * direction, which pushes through it. Set to 0 to disable and see the
 * difference. */
#define SERVO_BACKLASH_US   25.0f

/* Sign convention: which way a positive heading error should steer.
 *
 * CHANGED FROM +1 TO -1 WHEN HEADING MOVED TO THE GYRO. The two heading
 * sources count in OPPOSITE directions, and this is the constant that
 * absorbs it:
 *
 *   Encoder:  d_theta = (dA - dB) / track, and Motor A is the LEFT rear.
 *             On a left (counter-clockwise) turn the left wheel is on the
 *             inside, so dA < dB and d_theta comes out NEGATIVE.
 *             The encoder path is therefore CLOCKWISE-positive, whatever
 *             the "CCW positive" comment on Odom_Pose_t says.
 *
 *   Gyro:     IMU_Z_SIGN +1 was verified on the robot by rotating it
 *             anticlockwise and watching the heading INCREASE.
 *             Counter-clockwise-positive.
 *
 * So switching source inverted the sign of every heading error, and a loop
 * with the wrong sign steers INTO the error rather than out of it - which
 * looks like the robot suddenly steering hard one way.
 *
 * If you ever switch ODOM_HEADING_SOURCE back to the encoder, flip this
 * back to +1 at the same time.
 *
 * VERIFY, do not trust: start a straight run, let it settle, nudge the nose
 * a few degrees by hand. The front wheels must turn to steer BACK toward the
 * original line. If they turn the same way you nudged, flip this. */
#define HEADING_SIGN        (-1)

typedef struct
{
    float x_mm;         /* forward from the start pose   */
    float y_mm;         /* left of the start pose        */
    float heading_deg;  /* sign follows ODOM_HEADING_SOURCE; wraps to +-180 */
    float distance_mm;  /* total path length travelled   */
} Odom_Pose_t;

/* Zeroes the pose and syncs to the current encoder counts. Call at startup
 * after Encoders_Init() and Servos_Init(). */
void Odom_Init(void);

/* Clears the pose to the origin without disturbing the encoders. */
void Odom_Reset(void);

/* One integration step. Call from the TIM6 ISR, after Encoders_Update()
 * and before PID_Update(). */
void Odom_Update(void);

/* Current pose. Safe to call from the main loop. */
void Odom_GetPose(Odom_Pose_t *out);

float Odom_GetHeading(void);
float Odom_GetDistance(void);

/* ------------------------------------------------------------------ */
/* Heading hold                                                        */
/* ------------------------------------------------------------------ */

/* Drive at the given speed holding the current heading. Negative rpm
 * reverses; the correction sign is flipped automatically. */
void Odom_DriveStraight(int16_t rpm);

/* Drive at the given speed holding a specific heading in degrees. */
void Odom_DriveHeading(int16_t rpm, float heading_deg);

/* Change speed WITHOUT disturbing the active drive mode.
 *
 * Odom_DriveHeading() latches a new heading target, zeroes the accumulated
 * error and recentres the servo. That is right when a move starts and wrong
 * in the middle of one: calling it to slow down for the approach throws away
 * the correction the loop had settled on and snaps the steering to centre,
 * which shows up as a visible twitch in the last 150 mm of the run - exactly
 * the part the supervisor is watching for A.3.
 *
 * This changes only the setpoint. For an arc the inner/outer split is
 * recomputed at the new speed and the servo is left where it is. */
void Odom_SetSpeed(int16_t rpm);

/* ------------------------------------------------------------------ */
/* Arc driving                                                         */
/* ------------------------------------------------------------------ */

/* Hold a fixed steering deflection and drive an arc.
 *
 * Heading hold is OFF for the duration - on an Ackermann chassis the heading
 * is set by the steering angle, and a heading loop fighting a deliberate turn
 * just cancels it.
 *
 * The two rear wheels are commanded at DIFFERENT speeds. There is no
 * mechanical differential here; both rear wheels are driven independently, so
 * if they are told to run at the same RPM through a turn the inner one is
 * dragged and both tyres scrub. Speeds are split from the geometry:
 *
 *     v_outer / v_inner = (R + track/2) / (R - track/2)
 *
 * radius_mm is measured at the CENTRE of the rear axle, which is also what
 * Odom_GetDistance() reports, so arc length = radius * angle.
 *
 * right: 1 to curve right (Motor B inner), 0 to curve left (Motor A inner).
 * Negative rpm reverses. */
void Odom_DriveArc(int16_t rpm, uint16_t servo_us, float radius_mm, uint8_t right);

/* Stops the robot, recentres the steering, disables heading hold. */
void Odom_Stop(void);

/* The servo pulse width the heading loop is currently commanding, in
 * microseconds. Equals SERVO_CENTER_US when the robot is on course.
 * Exposed for tuning - put it on the OLED. */
uint16_t Odom_GetServoUs(void);

/* Heading error the loop is currently acting on, degrees. Also for tuning. */
float Odom_GetHeadingError(void);

/* ------------------------------------------------------------------ */
/* Calibration helper                                                  */
/* ------------------------------------------------------------------ */

/* Spin-test support for refining WHEEL_BASE_MM. Note this is of limited use
 * on an Ackermann chassis, which cannot turn on the spot - it is kept for
 * the hand-pushed bench check only. */
void  Odom_CalibrateSpinStart(void);
float Odom_CalibrateSpinResult(void);

#endif /* __ODOM_H */
